Revit 2026 API

# AssetPropertyListIsValidValue Method

---
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidValue(
	IList<AssetProperty> value
)
```
```vb
Public Function IsValidValue (
	value As IList(Of AssetProperty)
) As Boolean
```
```cpp
public:
bool IsValidValue(
	IList<AssetProperty^>^ value
)
```
```fsharp
member IsValidValue :
        value : IList<AssetProperty> -> bool
```

#### Parameters

value IListAssetProperty

#### Return Value

Boolean

#### Reference

AssetPropertyList Class

Autodesk.Revit.DB.Visual Namespace